# Ex - GroupBy

In [15]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [16]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv"

drinks = pd.read_csv(url)
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [17]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [18]:
drinks.describe(include="all")

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193,193.000000,193.000000,193.000000,193.000000,170
unique,193,NaN,NaN,NaN,NaN,5
top,Afghanistan,NaN,NaN,NaN,NaN,AF
freq,1,NaN,NaN,NaN,NaN,53
mean,NaN,106.160622,80.994819,49.450777,4.717098,NaN
std,NaN,101.143103,88.284312,79.697598,3.773298,NaN
min,NaN,0.000000,0.000000,0.000000,0.000000,NaN
25%,NaN,20.000000,4.000000,1.000000,1.300000,NaN
50%,NaN,76.000000,56.000000,8.000000,4.200000,NaN
75%,NaN,188.000000,128.000000,59.000000,7.200000,NaN
max,NaN,376.000000,438.000000,370.000000,14.400000,NaN

In [19]:
drinks[drinks["continent"].isnull()][["country","continent"]]

                          country continent
5               Antigua & Barbuda       NaN
11                        Bahamas       NaN
14                       Barbados       NaN
17                         Belize       NaN
32                         Canada       NaN
41                     Costa Rica       NaN
43                           Cuba       NaN
50                       Dominica       NaN
51             Dominican Republic       NaN
54                    El Salvador       NaN
68                        Grenada       NaN
69                      Guatemala       NaN
73                          Haiti       NaN
74                       Honduras       NaN
84                        Jamaica       NaN
109                        Mexico       NaN
122                     Nicaragua       NaN
130                        Panama       NaN
143             St. Kitts & Nevis       NaN
144                     St. Lucia       NaN
145  St. Vincent & the Grenadines       NaN
174             Trinidad & Tobago       NaN
184                           USA       NaN

In [20]:
drinks["continent"].unique()

array(['AS', 'EU', 'AF', nan, 'SA', 'OC'], dtype=object)

In [21]:
# drinks.loc[drinks["continent"].isna()] = "NA"

In [22]:
drinks["continent"].fillna("NA",inplace=True)

C:\Users\pacof\AppData\Local\Temp\ipykernel_21136\3220297699.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  drinks["continent"].fillna("NA",inplace=True)

In [23]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

### Step 4. Which continent drinks more beer on average?

In [24]:
drinks.groupby("continent")["beer_servings"].mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
NA    145.434783
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [25]:
drinks.groupby("continent")["beer_servings"].mean().idxmax()

'EU'

### Step 5. For each continent print the statistics for wine consumption.

In [26]:
drinks.groupby("continent")["wine_servings"].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
NA          23.0   24.521739  28.266378  1.0   5.0   11.0   34.00  100.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [27]:
drinks.groupby("continent")["wine_servings"].aggregate(['mean','sum','std','min','max'])

                 mean   sum        std  min  max
continent
AF          16.264151   862  38.846419    0  233
AS           9.068182   399  21.667034    0  123
EU         142.222222  6400  97.421738    0  370
NA          24.521739   564  28.266378    1  100
OC          35.625000   570  64.555790    0  212
SA          62.416667   749  88.620189    1  221

### Step 6. Print the mean alcohol consumption per continent for every column

In [28]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [29]:
drinks.groupby("continent")[["beer_servings","spirit_servings","wine_servings","total_litres_of_pure_alcohol"]].mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
NA,145.434783,165.739130,24.521739,5.995652
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Step 7. Print the median alcohol consumption per continent for every column

In [30]:
drinks.groupby("continent")[["beer_servings","spirit_servings","wine_servings","total_litres_of_pure_alcohol"]].median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
NA,143.0,137.0,11.0,6.30
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Step 8. Print the mean, min and max values for spirit consumption per continent.

In [36]:
drinks.groupby("continent")[["spirit_servings"]].aggregate(["mean","min","max"]).round(2)

          spirit_servings
                     mean min  max
continent
AF                  16.34   0  152
AS                  60.84   0  326
EU                 132.56   0  373
NA                 165.74  68  438
OC                  58.44   0  254
SA                 114.75  25  302

In [44]:
drinks.loc[drinks["continent"] == "EU"][["country", "spirit_servings"]].sort_values("spirit_servings",ascending=True)

                country  spirit_servings
111              Monaco                0
147          San Marino                0
170           Macedonia               27
83                Italy               42
10           Azerbaijan               46
156            Slovenia               51
165              Sweden               60
76              Iceland               61
136            Portugal               67
126              Norway               71
9               Austria               75
48              Denmark               81
16              Belgium               84
42              Croatia               87
120         Netherlands               88
105               Malta              100
166         Switzerland              100
64              Georgia              100
67               Greece              112
113          Montenegro              114
65              Germany              117
81              Ireland              118
140             Romania              122
182      United Kingdom              126
151              Serbia              131
1               Albania              132
99           Luxembourg              133
60              Finland              133
3               Andorra              138
61               France              151
44               Cyprus              154
160               Spain              157
45       Czech Republic              170
21   Bosnia-Herzegovina              173
7               Armenia              179
57              Estonia              194
75              Hungary              215
135              Poland              215
93               Latvia              216
139             Moldova              226
180             Ukraine              237
98            Lithuania              244
25             Bulgaria              252
155            Slovakia              293
15              Belarus              373